2) /var/www/app/Helpers/BookAuthorFaker.php:14    [M] DecrementInteger

--- Original
+++ New
@@ @@
     /**
      * @param int $entitiesQuantity
      */
-    public static function fake(int $entitiesQuantity = 100)
+    public static function fake(int $entitiesQuantity = 99)
     {
         factory(Author::class, $entitiesQuantity)->create();
         factory(Book::class, $entitiesQuantity)->create();

3) /var/www/app/Helpers/BookAuthorFaker.php:14    [M] IncrementInteger

--- Original
+++ New
@@ @@
     /**
      * @param int $entitiesQuantity
      */
-    public static function fake(int $entitiesQuantity = 100)
+    public static function fake(int $entitiesQuantity = 101)
     {
         factory(Author::class, $entitiesQuantity)->create();
         factory(Book::class, $entitiesQuantity)->create();

4) /var/www/app/Helpers/BookAuthorFaker.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public static function fake(int $entitiesQuantity = 100)
     {
         factory(Author::class, $entitiesQuantity)->create();
-        factory(Book::class, $entitiesQuantity)->create();
+        
         $authors = Author::all();
         Book::all()->each(function ($book) use($authors) {
             $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());

5) /var/www/app/Helpers/BookAuthorFaker.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         factory(Author::class, $entitiesQuantity)->create();
         factory(Book::class, $entitiesQuantity)->create();
         $authors = Author::all();
-        Book::all()->each(function ($book) use($authors) {
-            $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());
-        });
+        
     }
 }

6) /var/www/app/Helpers/BookAuthorFaker.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         factory(Book::class, $entitiesQuantity)->create();
         $authors = Author::all();
         Book::all()->each(function ($book) use($authors) {
-            $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());
+            
         });
     }
 }

7) /var/www/app/Helpers/BookAuthorFaker.php:22    [M] IncrementInteger

--- Original
+++ New
@@ @@
         factory(Book::class, $entitiesQuantity)->create();
         $authors = Author::all();
         Book::all()->each(function ($book) use($authors) {
-            $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());
+            $book->authors()->attach($authors->random(rand(2, 5))->pluck('id')->toArray());
         });
     }
 }

8) /var/www/app/Helpers/BookAuthorFaker.php:22    [M] OneZeroInteger

--- Original
+++ New
@@ @@
         factory(Book::class, $entitiesQuantity)->create();
         $authors = Author::all();
         Book::all()->each(function ($book) use($authors) {
-            $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());
+            $book->authors()->attach($authors->random(rand(0, 5))->pluck('id')->toArray());
         });
     }
 }

9) /var/www/app/Helpers/BookAuthorFaker.php:22    [M] DecrementInteger

--- Original
+++ New
@@ @@
         factory(Book::class, $entitiesQuantity)->create();
         $authors = Author::all();
         Book::all()->each(function ($book) use($authors) {
-            $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());
+            $book->authors()->attach($authors->random(rand(1, 4))->pluck('id')->toArray());
         });
     }
 }

10) /var/www/app/Helpers/BookAuthorFaker.php:22    [M] IncrementInteger

--- Original
+++ New
@@ @@
         factory(Book::class, $entitiesQuantity)->create();
         $authors = Author::all();
         Book::all()->each(function ($book) use($authors) {
-            $book->authors()->attach($authors->random(rand(1, 5))->pluck('id')->toArray());
+            $book->authors()->attach($authors->random(rand(1, 6))->pluck('id')->toArray());
         });
     }
 }

11) /var/www/app/Http/Controllers/TestController.php:10    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Exception;
 class TestController extends Controller
 {
-    public function hello()
+    protected function hello()
     {
         return view('welcome');
     }
 }

12) /var/www/app/Http/Controllers/TestController.php:12    [M] FunctionCall

--- Original
+++ New
@@ @@
 {
     public function hello()
     {
-        return view('welcome');
+        view('welcome');
+        return null;
     }
 }

14) /var/www/app/Http/Middleware/RedirectIfAuthenticated.php:21    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function handle($request, Closure $next, $guard = null)
     {
         if (Auth::guard($guard)->check()) {
-            return redirect('/home');
+            redirect('/home');
+            return null;
         }
         return $next($request);
     }

16) /var/www/app/Models/Author.php:42    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * @return BelongsToMany
      */
-    public function books() : BelongsToMany
+    protected function books() : BelongsToMany
     {
         return $this->belongsToMany(Book::class, 'books_authors', 'author_id', 'book_id');
     }
 }
